; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v2 ?v11)
             (pred_9 ?v4 ?v3)
             (pred_11 ?v2 ?v3)
             (pred_3 ?v9 ?v2 )
	     (pred_6 ?v2)
             (pred_1 ?v6)
             (pred_7 ?v4)
             (pred_12 ?v3)
             (pred_5 ?v2)
             (pred_2 ?v4)
             (pred_10 ?v2)
             (pred_4 ))



(:action op_5
:parameters (?v8 ?v12 ?v5 ?v10)
:precondition (and (pred_1 ?v8) (pred_1 ?v12) (pred_7 ?v5) (pred_12 ?v10)
          (pred_8 ?v8 ?v12) (pred_9 ?v5 ?v10)
                   (pred_11 ?v12 ?v10) (pred_6 ?v8) 
                   (pred_5 ?v12) (pred_2 ?v5))
:effect (and  (pred_10 ?v12) (not (pred_5 ?v12))))


(:action op_2
:parameters (?v8 ?v13)
:precondition (and (pred_1 ?v8) (pred_1 ?v13)
               (pred_6 ?v8) (pred_8 ?v8 ?v13) (pred_10 ?v13))
:effect (and (pred_6 ?v13) (not (pred_6 ?v8))))

(:action op_3
:parameters (?v8 ?v5)
:precondition (and (pred_1 ?v8) (pred_7 ?v5) 
                  (pred_6 ?v8) (pred_3 ?v5 ?v8) (pred_4 ))
:effect (and (pred_2 ?v5)
   (not (pred_3 ?v5 ?v8)) (not (pred_4 ))))


(:action op_4
:parameters (?v8 ?v7 ?v1)
:precondition (and (pred_1 ?v8) (pred_7 ?v7) (pred_7 ?v1)
                  (pred_6 ?v8) (pred_2 ?v1) (pred_3 ?v7 ?v8))
:effect (and (pred_2 ?v7) (pred_3 ?v1 ?v8)
        (not (pred_2 ?v1)) (not (pred_3 ?v7 ?v8))))

(:action op_1
:parameters (?v8 ?v5)
:precondition (and (pred_1 ?v8) (pred_7 ?v5) 
                  (pred_6 ?v8) (pred_2 ?v5))
:effect (and (pred_4 ) (pred_3 ?v5 ?v8) (not (pred_2 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_01 obj_06 obj_22 obj_12 obj_20 obj_14 obj_07 obj_19 obj_15 obj_04 obj_11 obj_13 obj_10 obj_21 obj_17
    obj_09 obj_05 obj_08
    obj_03 obj_02 obj_16
    )

    (:init
       (pred_4)

       (pred_1 obj_18)
       (pred_1 obj_01)
       (pred_1 obj_06)
       (pred_1 obj_22)
       (pred_1 obj_12)
       (pred_1 obj_20)
       (pred_1 obj_14)
       (pred_1 obj_07)
       (pred_1 obj_19)
       (pred_1 obj_15)
       (pred_1 obj_04)
       (pred_1 obj_11)
       (pred_1 obj_13)
       (pred_1 obj_10)
       (pred_1 obj_21)
       (pred_1 obj_17)
       (pred_12 obj_09)
       (pred_12 obj_05)
       (pred_12 obj_08)
       (pred_7 obj_03)
       (pred_7 obj_02)
       (pred_7 obj_16)

       (pred_8 obj_18 obj_12)
       (pred_8 obj_18 obj_01)
       (pred_8 obj_01 obj_20)
       (pred_8 obj_01 obj_06)
       (pred_8 obj_01 obj_18)
       (pred_8 obj_06 obj_14)
       (pred_8 obj_06 obj_22)
       (pred_8 obj_06 obj_01)
       (pred_8 obj_22 obj_07)
       (pred_8 obj_22 obj_06)
       (pred_8 obj_12 obj_19)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_12 obj_18)
       (pred_8 obj_20 obj_15)
       (pred_8 obj_20 obj_14)
       (pred_8 obj_20 obj_01)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_14 obj_04)
       (pred_8 obj_14 obj_07)
       (pred_8 obj_14 obj_06)
       (pred_8 obj_14 obj_20)
       (pred_8 obj_07 obj_11)
       (pred_8 obj_07 obj_22)
       (pred_8 obj_07 obj_14)
       (pred_8 obj_19 obj_13)
       (pred_8 obj_19 obj_15)
       (pred_8 obj_19 obj_12)
       (pred_8 obj_15 obj_10)
       (pred_8 obj_15 obj_04)
       (pred_8 obj_15 obj_20)
       (pred_8 obj_15 obj_19)
       (pred_8 obj_04 obj_21)
       (pred_8 obj_04 obj_11)
       (pred_8 obj_04 obj_14)
       (pred_8 obj_04 obj_15)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_11 obj_07)
       (pred_8 obj_11 obj_04)
       (pred_8 obj_13 obj_10)
       (pred_8 obj_13 obj_19)
       (pred_8 obj_10 obj_21)
       (pred_8 obj_10 obj_15)
       (pred_8 obj_10 obj_13)
       (pred_8 obj_21 obj_17)
       (pred_8 obj_21 obj_04)
       (pred_8 obj_21 obj_10)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_17 obj_21)
       (pred_5 obj_22)
       (pred_5 obj_21)
       (pred_5 obj_06)
       (pred_11  obj_22 obj_09)
       (pred_11  obj_21 obj_05)
       (pred_11  obj_06 obj_08)
       (pred_10 obj_18)
       (pred_10 obj_01)
       (pred_10 obj_12)
       (pred_10 obj_20)
       (pred_10 obj_14)
       (pred_10 obj_07)
       (pred_10 obj_19)
       (pred_10 obj_15)
       (pred_10 obj_04)
       (pred_10 obj_11)
       (pred_10 obj_13)
       (pred_10 obj_10)
       (pred_10 obj_17)

       (pred_9  obj_03 obj_09)
       (pred_9  obj_02 obj_05)
       (pred_9  obj_16 obj_08)
       (pred_3 obj_03 obj_15)
       (pred_3 obj_02 obj_06)
       (pred_3 obj_16 obj_19)
       (pred_6 obj_11)
    )

    (:goal (and
       (pred_3 obj_03 obj_10)
       (pred_3 obj_16 obj_13)
    ))
(:constraints
  (always (not (pred_6 obj_04)))
)
)

; plan
1. (op_2 obj_11 obj_07)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_07)
   goals met: 0 of 2
2. (op_2 obj_07 obj_14)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_14)
   goals met: 0 of 2
3. (op_2 obj_14 obj_20)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_20)
   goals met: 0 of 2
4. (op_2 obj_20 obj_15)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_15)
   goals met: 0 of 2
5. (op_3 obj_15 obj_03)
   deleted: (pred_3 obj_03 obj_15) (pred_4)
   added: (pred_2 obj_03)
   goals met: 0 of 2
6. (op_2 obj_15 obj_19)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_19)
   goals met: 0 of 2
7. (op_4 obj_19 obj_16 obj_03)
   deleted: (pred_2 obj_03) (pred_3 obj_16 obj_19)
   added: (pred_2 obj_16) (pred_3 obj_03 obj_19)
   goals met: 0 of 2
8. (op_2 obj_19 obj_13)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_13)
   goals met: 0 of 2
9. (op_1 obj_13 obj_16)
   deleted: (pred_2 obj_16)
   added: (pred_4) (pred_3 obj_16 obj_13)
   goals met: 1 of 2
10. (op_2 obj_13 obj_19)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_19)
   goals met: 1 of 2
11. (op_3 obj_19 obj_03)
   deleted: (pred_3 obj_03 obj_19) (pred_4)
   added: (pred_2 obj_03)
   goals met: 1 of 2
12. (op_2 obj_19 obj_15)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_15)
   goals met: 1 of 2
13. (op_2 obj_15 obj_10)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_10)
   goals met: 1 of 2
14. (op_1 obj_10 obj_03)
   deleted: (pred_2 obj_03)
   added: (pred_4) (pred_3 obj_03 obj_10)
   goals met: 2 of 2
